In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
covid_cases_file = "Data_Transformation/Covid_Transformed.csv"
covid_cases = pd.read_csv(covid_cases_file)
covid_cases.head()

    county  month  new_cases  new_deaths
0  Alameda      3        269           7
1  Alameda      4       1330          56
2  Alameda      5       1763          41
3  Alameda      6       2705          31
4  Alameda      7       5374          47

In [3]:
unemployment_numbers_file = "Data_Transformation/Unempolyment_Transformed.csv"
unemployment_numbers = pd.read_csv(unemployment_numbers_file )
unemployment_numbers.head()

    county  month  labor_force  employment  unemployment  unemployment_rate
0  Alameda      1       841300      815500         25700              0.031
1  Alameda      2       840400      815400         25000              0.030
2  Alameda      3       835400      802700         32700              0.039
3  Alameda      4       804200      691200        112900              0.140
4  Alameda      5       803400      693400        110100              0.137

In [4]:
home_price_file = "Data_Transformation/Home_Prices_Transformed.csv"
home_price = pd.read_csv(home_price_file)
home_price= home_price[['county','month', 'price']]
home_price.head()

           county  month   price
0     Los Angeles      2  648559
1       San Diego      2  622347
2          Orange      2  756030
3       Riverside      2  399386
4  San Bernardino      2  364813

In [5]:
county_population_file = "Data_Transformation/Population_Transformed.csv"
county_population = pd.read_csv(county_population_file)
county_population = county_population[['county','population', 'growthrate']]
county_population.head()

           county  population  growthrate
0     Los Angeles    10105500      2.8819
1       San Diego     3343360      7.7353
2          Orange     3185970      5.6160
3       Riverside     2450760     11.3147
4  San Bernardino     2171600      6.4035

In [19]:
connection_string = "postgres:test123@localhost:5432/covid_cases2"
engine = create_engine(f'postgresql://{connection_string}')

In [20]:
engine.table_names()

['covid_cases', 'unemployment_numbers', 'home_price', 'county_population']

In [21]:
covid_cases.to_sql(name = 'covid_cases', con = engine, if_exists= 'append', index= False)

In [22]:
unemployment_numbers.to_sql(name = 'unemployment_numbers', con = engine, if_exists = 'append', index = False)

In [23]:
home_price.to_sql(name = 'home_price', con = engine, if_exists = 'append', index = False)

In [24]:
county_population.to_sql(name = 'county_population', con = engine, if_exists = 'append', index = False)